Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConvertDuctPlaceholders(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Converts a collection of duct placeholder elements into duct elements.
Remarks:
Once conversion succeeds, the duct placeholder elements are deleted.
The new duct and fitting elements are created and connections are established.
document:
The document.
placeholderIds:
A collection of element IDs of duct placeholders.
Returns:
A collection of element IDs of ducts and fittings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
The given element IDs (placeholderIds) are not duct placeholders.
-or-
The elements belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012